Revit 2026 API

# Transform Properties

---

The Transform type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Basis | Defines the basis of the old coordinate system in the new coordinate system. |
|  | BasisX | The basis of the X axis of this transformation. |
|  | BasisY | The basis of the Y axis of this transformation. |
|  | BasisZ | The basis of the Z axis of this transformation. |
|  | Determinant | The determinant of this transformation. |
|  | HasReflection | The boolean value that indicates whether this transformation produces reflection. |
|  | Identity | The identity transformation. |
|  | Inverse | The inverse transformation of this transformation. |
|  | IsConformal | The boolean value that indicates whether this transformation is conformal. |
|  | IsIdentity | The boolean value that indicates whether this transformation is an identity. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsTranslation | The boolean value that indicates whether this transformation is a translation. |
|  | Origin | Defines the origin of the old coordinate system in the new coordinate system. |
|  | Scale | The real number that represents the scale of the transformation. |

#### Reference

Transform Class

Autodesk.Revit.DB Namespace